data/verification/convergence_4x/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16000
(
(1.25e-05 1.25e-05 5e-06)
(3.75e-05 1.25e-05 5e-06)
(6.25e-05 1.25e-05 5e-06)
(8.75e-05 1.25e-05 5e-06)
(0.0001125 1.25e-05 5e-06)
(0.0001375 1.25e-05 5e-06)
(0.0001625 1.25e-05 5e-06)
(0.0001875 1.25e-05 5e-06)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0 1.25e-05 5e-06)
(0 3.75e-05 5e-06)
(0 6.25e-05 5e-06)
(0 8.75e-05 5e-06)
(0 0.0001125 5e-06)
(0 0.0001375 5e-06)
(0 0.0001625 5e-06)
(0 0.0001875 5e-06)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0.01 1.25e-05 5e-06)
(0.01 3.75e-05 5e-06)
(0.01 6.25e-05 5e-06)
(0.01 8.75e-05 5e-06)
(0.01 0.0001125 5e-06)
(0.01 0.0001375 5e-06)
(0.01 0.0001625 5e-06)
(0.01 0.0001875 5e-06)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
800
(
(1.25e-05 0 5e-06)
(3.75e-05 0 5e-06)
(6.25e-05 0 5e-06)
(8.75e-05 0 5e-06)
(0.0001125 0 5e-06)
(0.0001375 0 5e-06)
(0.0001625 0 5e-06)
(0.0001875 0 5e-06)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
