data/verification/convergence_4x/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16000
(
1.25e-05
3.75e-05
6.25e-05
8.75e-05
0.0001125
0.0001375
0.0001625
0.0001875
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.01
0.01
0.01
0.01
0.01
0.01
0.01
0.01
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
800
(
1.25e-05
3.75e-05
6.25e-05
8.75e-05
0.0001125
0.0001375
0.0001625
0.0001875
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
